Repository: Clod/cardio_score_duo
Catalog: lib/l10n/app_*.arb
Languages: es

# appTitle
source: AHA 2020 Goals for Adults Aged ≥ 20 Years
es: Score de Salud Cardiovascular Infantil

source: Metric
es: Métrica

source: Poor
es: Pobre

source: Intermediate
es: Intermedia

# metricSmokingStatus
source: Current smoking
es: Fuma

# metricPhysicalActivityLevel
source: Physical activity †
es: Actividad física

# metricHealthyDietScore
source: Healthy diet pattern †
es: Dieta sana

# metricTotalChoresterol
source: Total cholesterol
es: Colesterol total

# metricBloodPressure
source: Blood pressure
es: Presión arterial

# metricFastingBloodGlucose
source: Fasting plasma glucose
es: Glucemia

source: Result:
es: Puntaje:

# poorSmokingStatus
source: Yes
es: > 30 días

# poorBMI
source: ≥30 kg/m2
es: >percentilo95

# poorPhysicalActivityLevel
source: None
es: Ninguna

# poorHealthyDietScore
source: 0-1 components
es: 0-1 componentes

# poorTotalChoresterol
source: ≥240mg/dl
es: ≥200mg/dl

# poorBloodPressure
source: SBP ≥140 mmHg or DBP ≥90 mmHg
es: >percentilo95

# intermSmokingStatus
source: Former ≤ 12 months
es: Interm.

# intermBMI
source: 25-29.9 kg/m2
es: 85-90 pc

# intermPhysicalActivityLevel
source: 1-149 min/wk moderate or 1-74 min/wk vigorous 1-149 min/wk mod. + 2x vig. >0 min <60 min of mod. or vig. every day
es: 0 a 60 min dia

# intermHealthyDietScore
source: 2-3 components
es: 2-3 componentes

# intermTotalChoresterol
source: 200-239 mg/dL or treated to goal
es: ≥170 <200 mg/dl

# intermBloodPressure
source: SBP 120-139 mmHg or DBP 80-89 mmHg or treated to goal
es: 90-95 pc

# idealSmokingStatus
source: Never or quit >12 months Never tried; never smoked whole cigarette
es: Nunca

# idealPhysicalActivityLevel
source: ≥150 min/wk moderate or ≥75 min/wk vigorous ≥150 min/wk mod. + 2x vig. ≥60 of mod. or vig. every day
es: ≥60min

# idealHealthyDietScore
source: 4-5 components
es: 4-5 componentes

# idealTotalChoresterol
source: <200mg/dl
es: <170mg/dl

# idealBloodPressure
source: <120 mmHg/ <80 mmHg
es: <90pc
